<template>
  <van-popup
    v-model="visible"
    position="right"
    :safe-area-inset-bottom="true"
    :close-on-click-overlay="false"
    get-container="body"
  >
    <c-popup-layout title="发帖规范" @back="visible = false">
      <div class="block">
        <div class="title">一、个人账号昵称及头像 个人简介</div>
        <p>
          账号信息中不能带有或近似党和国家领导人、国家机构及含有广告和宣传性质的内容，不要有攻击、侮辱、挑衅、猥亵或广告性质内容，还有请不要在使用带有官网小编字样或Q
          Q 号、微 信 号，一旦发现管理人员有权对您的账号进行昵称违规警告并开具处罚哟。
        </p>
      </div>
      <div class="block">
        <div class="title">二、发布内容</div>
        <p>
          倡导文明、客观、理性、宽容、分享、互助、友好、关怀的发帖原则和圈子氛围。严禁发布国家法律法规不允许的内容及危害社区良好环境的内容：
        </p>
        <p>
          1、严禁一切分裂祖国、危害人民和社会安定的信息，涉黄涉暴涉恐涉政等内容，一经发现立即删除并对该账号及设备进行永久封禁。必要时我们也内容如下：
        </p>
        <p>
          2、如果发布含有违规内容的帖子，将会被删除并处罚，情节严重的还将上报给公安部门，请大家务必遵守他趣圈规，切勿发布违规内容！具体违规内容如下：
        </p>
        <p>3、直接暴露和描写人体性部位的内容；</p>
        <p>4、表现或隐晦表现性行为、具有挑逗性或者侮辱性的内容；</p>
        <p>5、以带有性暗示、性挑逗的语言描述性行为、性过程、性方式的内容；</p>
        <p>6、全身或者隐私部位未着衣物，仅用肢体掩盖隐私部位的内容；</p>
        <p>7、带有侵犯个人隐私性质的走光、偷拍、露点等内容；</p>
        <p>8、以庸俗和挑逗性标题吸引点击的内容；</p>
        <p>9、相关部门禁止传播的色情和有伤社会风化的文字、音视频内容，包括一些电影的删节片段；</p>
        <p>10、传播一夜情、换 妻、性虐待等的有害信息；</p>
        <p>11、情色动漫；</p>
        <p>12、宣扬暴力、恶意谩骂、侮辱他人等的内容；</p>
        <p>13、非法性药品广告和性病治疗广告等相关内容；</p>
        <p>14、恶意传播侵害他人隐私的内容；</p>
        <p>15、严禁推荐淫秽色 情网站和网上低俗信息的链接、图片、文字等内容。</p>
        <p>
          16、严禁散布色情交易、不正当交友等信息；侵犯他人隐私的内容，包括走光、偷拍、露点，以及利用网络恶意传播他人隐私的信息等；违背正确婚恋观和家庭伦理道德的内容。
        </p>
        <p>
          17、严打各类小广告：包括但不限于淘宝兼 职、视频自拍、扣
          扣群号、网址、网店微店、其他应用信息等。一经发现立即删除并对该账号及设备进行永久封禁。
        </p>
        <p>
          18、禁止在帖子内留联系方式：包括但不限于手机号、扣 扣、微
          信、摩斯密码等，一经发现立即删除并视情况进行处罚。
        </p>
        <p>
          19、不欢迎布无意义无内容的数字、字母、符号等水贴，如：123456、adsfsdf、，，，，，，、。一经发现立即删除，严重者进行相对应处罚。
        </p>
        <p>
          20、利用平台漏洞，对平台进行DDoS攻击、扰乱或冲击平台的虚拟货币金融秩序、窃取平台内用户信息、利用平台进行违法犯罪活动。用户进行违规操作的，平台有权违规用户予以警示、限制使用或封禁账号。
        </p>
        <p>21、欢迎广大朋友们一起维护社区环境，积极举报不良信息。</p>
      </div>
      <div class="block">
        <div class="title">三、用词规范</div>
        <p>
          请大家尽量使用文明深刻有内涵，通俗易懂显智慧的关于生理健康的字样，不要出现传统的很黄很暴力的话题，回复等描述。不要出现恶意刷楼现象。这样既尊重了看贴的高端女性用户，又彰显您的幽默风趣，还避免了违法或帖子被马赛克转化的面目全非哦～
        </p>
      </div>
      <div class="block">
        <div class="title">四、知识产权</div>
        <p>
          鼓励原创，同时维护任何一个作者的知识产权，未经作者本人允许，不得转载。
          在非商业目的的前提，如将其他渠道的内容转载，请在帖子标题注明【转载】，并在正文部分注明原作者姓名。如非法盗用他人著作，一经发现，立即删除，并对该帐号警告处理。
        </p>
      </div>
    </c-popup-layout>
  </van-popup>
</template>

<script>
import PopupLayout from "@/components/comm/PopupLayout";
export default {
  components: {
    "c-popup-layout": PopupLayout
  },
  data() {
    return {
      visible: false
    };
  },
  methods: {
    open() {
      this.visible = true;
    },
    close() {
      this.visible = false;
    }
  }
};
</script>

<style lang="less" scoped>
.block {
  padding: 15px;
  font-size: 12px;
  .title {
    font-weight: 700;
    margin-bottom: 10px;
  }
  p {
    font-size: 10px;
    color: #666;
    margin-bottom: 10px;
  }
}
</style>
